RobWilks/nrf51_ADXL345/main_adxl345.c
    case BSP_EVENT_KEY_1: // Button 1 pushed.
        read_adxl345_registers();
        break;

    default:
        break;
    }
}
static void bsp_config(void)
{
    uint32_t err_code;

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    err_code = bsp_init(BSP_INIT_BUTTONS,
                        APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                        bsp_event_handler);
    APP_ERROR_CHECK(err_code);
}

////////////////////////////////////////////////////////////////////////////////
// TWI (with transaction manager) initialization.
static void twi_config(void)
{
    uint32_t err_code;

    nrf_drv_twi_config_t const config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_LOWEST,
       .clear_bus_init     = false
    };

    APP_TWI_INIT(&m_app_twi, &config, MAX_PENDING_TRANSACTIONS, err_code);
    APP_ERROR_CHECK(err_code);
}

////////////////////////////////////////////////////////////////////////////////
// RTC tick events generation.
static void rtc_handler(nrf_drv_rtc_int_type_t int_type) {
  static uint8_t tick_count;
  if (int_type == NRF_DRV_RTC_INT_TICK) {
    // On each RTC tick (their frequency is set in "nrf_drv_config.h")
    // we read data from our sensors.
    ++tick_count;
    if ((tick_count % 16) == 0) {
      read_xyz_data(ADXL345_DATAX0);
    }
  }
}

////////////////////////////////////////////////////////////////////////////////
// Initialize RTC instance with default configuration.
static void rtc_config(void)
{
    uint32_t err_code;

    
    nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
    config.prescaler = RTC_FREQ_TO_PRESCALER(32); //Set RTC frequency to 32Hz
    err_code = nrf_drv_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    // Enable tick event and interrupt.
    nrf_drv_rtc_tick_enable(&m_rtc, true);

    // Power on RTC instance.
    nrf_drv_rtc_enable(&m_rtc);
}


static void lfclk_config(void)
{
    uint32_t err_code;

    err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);
}

////////////////////////////////////////////////////////////////////////////////
//
int main(void)
{
    uint32_t err_code; // added for UART

    bsp_board_leds_init();


    // Initialise UART

        const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud115200
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);



    // Start internal LFCLK XTAL oscillator - it is needed by BSP to handle
    // buttons with the use of APP_TIMER and for "read_all" ticks generation
    // (by RTC).
    lfclk_config();

    bsp_config();

    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    uart_printf("TWI master example\r\n");
    twi_config();

    // Initialize sensors.
    /*
    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, lm75b_init_transfers,
        LM75B_INIT_TRANSFER_COUNT, NULL));
    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, mma7660_init_transfers,
        MMA7660_INIT_TRANSFER_COUNT, NULL));

    */


//    rjw initialisation of ADX345 

    APP_ERROR_CHECK(app_twi_perform(&m_app_twi, adxl345_init_transfers,
        ADXL345_INIT_TRANSFER_COUNT, NULL));

    /*************************** PRINT REG VALUES **************************/

    for (uint8_t i = 0x2f; i < 0x38; i++) {
      read_data(i);
      while (!got_callback) {
        ;
        ;
      }
      uart_printf("data_format: %d\n", m_buffer[0]);
    }

    nrf_delay_ms(1000); // to flush log

    set_range(4);

    //*************************** CHECK **************************/

    read_data(ADXL345_DATA_FORMAT);
    uart_printf("data_format: bit0 = %d\n", getRegisterBit(ADXL345_DATA_FORMAT, 0));
    uart_printf("bit1 = %d\n", getRegisterBit(ADXL345_DATA_FORMAT, 1));
 
    setRegisterBit(ADXL345_INT_MAP, 6, 1);
    uart_printf("INT_map: bit6 = %d\n", getRegisterBit(ADXL345_INT_MAP, 6));

    setTapThreshold(50);     // 62.5 mg per increment
    setTapDuration(15);      // 625 µs per increment
    setDoubleTapLatency(80); // 1.25 ms per increment
    setDoubleTapWindow(200); // 1.25 ms per increment
    uart_printf("Double Tap Window = %d\n", getDoubleTapWindow());
    uart_printf("TapDuration = %d\n", getTapDuration());

    setActivityXYZ(1, 0, 0);  // Set to activate movement detection in the axes "setActivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
    setActivityThreshold(75); // 62.5mg per increment   // Set activity   // Inactivity thresholds (0-255)

    setInactivityXYZ(1, 0, 0);  // Set to detect inactivity in all the axes "setInactivityXYZ(X, Y, Z);" (1 == ON, 0 == OFF)
    setInactivityThreshold(75); // 62.5mg per increment   // Set inactivity // Inactivity thresholds (0-255)
    setTimeInactivity(10);      // How many seconds of no activity is inactive?

    uart_printf("isActivityXEnabled = %d\n", isActivityXEnabled());
    uart_printf("isActivityYEnabled = %d\n", isActivityYEnabled());

    uart_printf("isInActivityXEnabled = %d\n", isInactivityXEnabled());


    rtc_config();

    LEDS_ON(LED_0);

    while (true) {
      __WFI();
    }
}

/** @} */